Revit 2027 API
BuiltInFailures.WallFailures.DisallowedPathCurve Property
 Cannot create stacked elliptical wall with offsets.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DisallowedPathCurve { get; }
Public Shared ReadOnly Property DisallowedPathCurve As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DisallowedPathCurve {
	FailureDefinitionId^ get ();
}
static member DisallowedPathCurve : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace